Revit 2017 API
StructuralSectionLProfileWithLips Class
 Defines parameters for L Profile with lips structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionLProfileWithLips : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionLProfileWithLips _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionLProfileWithLips : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
See Also
StructuralSectionLProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace